tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "ko1nksm/getoptions"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "libpng"
brew "zstd"
brew "libtiff"
brew "atuin", restart_service: :changed
brew "icu4c@77"
brew "awscli"
brew "node"
brew "bash-language-server"
brew "buf"
brew "glib"
brew "cargo-binstall"
brew "pycparser"
brew "cffi"
brew "chezmoi"
brew "cmake"
brew "lima"
brew "colima", restart_service: :changed
brew "cryptography"
brew "csvkit"
brew "difftastic"
brew "docker"
brew "docker-compose"
brew "dockerfile-language-server"
brew "docutils"
brew "libgit2"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gdb"
brew "gh"
brew "git-delta"
brew "git-filter-repo"
brew "git-recent"
brew "glow"
brew "gnu-getopt"
brew "unbound"
brew "gnutls"
brew "libassuan"
brew "gnupg"
brew "go"
brew "gopls"
brew "harfbuzz"
brew "haskell-stack"
brew "httpie"
brew "hub"
brew "ispell"
brew "openjdk"
brew "jdtls"
brew "jj"
brew "jq"
brew "kanata"
brew "kotlin"
brew "openjdk@21"
brew "kotlin-language-server"
brew "lazydocker"
brew "lazygit"
brew "pango"
brew "librsvg"
brew "llvm"
brew "mandown"
brew "markdown"
brew "marksman"
brew "minicom"
brew "usage"
brew "mise"
brew "mkcert"
brew "mold"
brew "mysql-client"
brew "neovim"
brew "nss"
brew "pass"
brew "patchutils"
brew "pipenv"
brew "pre-commit"
brew "pypy3.10"
brew "python@3.10"
brew "python@3.12"
brew "qemu"
brew "remake"
brew "ripgrep"
brew "rustup"
brew "sdl2"
brew "shellcheck"
brew "showkey"
brew "socat"
brew "terminal-notifier"
brew "tflint"
brew "thefuck"
brew "toml2json"
brew "wasmer"
brew "watch"
brew "wget"
brew "xcodegen"
brew "yaml-language-server"
brew "yazi"
brew "yq"
brew "hashicorp/tap/terraform-ls"
brew "ko1nksm/getoptions/getoptions"
brew "qmk/qmk/qmk"
cask "bruno"
cask "dbeaver-community"
cask "flycut"
cask "font-0xproto-nerd-font"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-d2coding-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-recursive-mono-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntu-sans-nerd-font"
cask "font-victor-mono-nerd-font"
cask "font-zed-mono-nerd-font"
cask "freecad"
cask "gcc-aarch64-embedded"
cask "gimp"
cask "iterm2"
cask "kdiff3"
cask "kitty"
cask "meld"
cask "qmk-toolbox"
cask "sequel-ace"
